---
kind: method
id: M:Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions.#ctor
source: html/b5897ede-7d66-9c5d-e120-6dbd529a62b6.htm
---
# Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions.#ctor Method

Constructs a new instance of BuildingEnvelopeAnalyzerOptions, using default values.

## Syntax (C#)
```csharp
public BuildingEnvelopeAnalyzerOptions()
```